# Задача 0 (Разминка)
# 1
a = [1, 0, 9, 12, 18, 34, 89, 91, 33, 127]
b = [2, 8, 9, 11, 76, 25, 44]

print("1)------------------------------------------------------------------------")
print("Первый элемент списка а: ", a[0])
print("Третий элемент списка а: ", a[2])
print("Последний элемент списка а: ", a[-1])

# 2
print("2)------------------------------------------------------------------------")
print(" Добавил в список b элемент 7")
b.append(7)
print(b)

# 3
print("3)------------------------------------------------------------------------")
print(" Заменил пятый элемент списка a на число 8")
a[4]=8
print(a)

# 4
print("4)------------------------------------------------------------------------")
print("Объединил списки А и В в списке merden")
merden= a + b
print(merden)

# 5
print("5)------------------------------------------------------------------------")
print("Создал новый список с , который получается заменой последнего элемента списка a на число 100")
c = a[:]
c[-1]=100
print("Cписок а: ", a)
print("Список с: ", c) 