# Задача 4 (игровая)

numbers = [1, 5, 6, 8, 10, 21, 25, 1, 0, -9, 9]

k = int(input("Введите целое число k от 1 до 10: "))
print("Итого: ", numbers[k-1])