print("Рецепт")


x = int(input("Политическая теория в граммах: "))
y = int(input("История политических учений в граммах: "))
z = int(input("Математика в граммах: "))

print("-------------------------------------------------------------")


def l(p):
    p = '{:.3f}'.format(p/1000)
    return p


print("Политическая теория: ", l(x), "кг")
print("История политических учений: ", l(y), "кг")
print("Математика: ", l(z), "кг")





























